In [2]:
#import required package
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
#read sale data.csv
data = pd.read_csv("/Users/changlu/Downloads/sales_data.csv")
data

         Product    Region   Price  Units Sold   Sale Date
0            NaN  Region_6   75.96        10.0  2022-01-01
1            NaN  Region_1  175.78         8.0  2022-01-02
2     Product_46  Region_3   20.43        12.0  2022-01-03
3     Product_36  Region_1   12.77        10.0  2022-01-04
4     Product_17  Region_6  125.69         6.0  2022-01-05
...          ...       ...     ...         ...         ...
1045  Product_45  Region_7   78.69         8.0  2022-07-28
1046   Product_1  Region_6     NaN         8.0  2022-08-02
1047  Product_17  Region_2  114.37        11.0  2023-12-18
1048         NaN  Region_8     NaN         5.0  2023-12-27
1049  Product_16  Region_2   69.30         8.0  2024-02-23

[1050 rows x 5 columns]

In [5]:
#drop duplicates
data.drop_duplicates(inplace=True)
data

        Product     Region   Price  Units Sold   Sale Date
0           NaN   Region_6   75.96        10.0  2022-01-01
1           NaN   Region_1  175.78         8.0  2022-01-02
2    Product_46   Region_3   20.43        12.0  2022-01-03
3    Product_36   Region_1   12.77        10.0  2022-01-04
4    Product_17   Region_6  125.69         6.0  2022-01-05
..          ...        ...     ...         ...         ...
995         NaN   Region_7   31.83        13.0  2024-09-22
996  Product_36        NaN   46.19         9.0  2024-09-23
997         NaN   Region_7  311.80        13.0  2024-09-24
998   Product_2  Region_10   43.44        15.0  2024-09-25
999  Product_35   Region_8   56.95         6.0  2024-09-26

[1000 rows x 5 columns]

In [7]:
#drop rows with unknown regions
data = data.dropna(subset='Region')
data

        Product     Region   Price  Units Sold   Sale Date
0           NaN   Region_6   75.96        10.0  2022-01-01
1           NaN   Region_1  175.78         8.0  2022-01-02
2    Product_46   Region_3   20.43        12.0  2022-01-03
3    Product_36   Region_1   12.77        10.0  2022-01-04
4    Product_17   Region_6  125.69         6.0  2022-01-05
..          ...        ...     ...         ...         ...
994   Product_1   Region_4   95.24         7.0  2024-09-21
995         NaN   Region_7   31.83        13.0  2024-09-22
997         NaN   Region_7  311.80        13.0  2024-09-24
998   Product_2  Region_10   43.44        15.0  2024-09-25
999  Product_35   Region_8   56.95         6.0  2024-09-26

[900 rows x 5 columns]

In [8]:
#create a column called "Revenue" by multiplying "Price" and "Units sold"
data['Revenue'] = data['Price'] * data['Units Sold']
data

        Product     Region   Price  Units Sold   Sale Date  Revenue
0           NaN   Region_6   75.96        10.0  2022-01-01   759.60
1           NaN   Region_1  175.78         8.0  2022-01-02  1406.24
2    Product_46   Region_3   20.43        12.0  2022-01-03   245.16
3    Product_36   Region_1   12.77        10.0  2022-01-04   127.70
4    Product_17   Region_6  125.69         6.0  2022-01-05   754.14
..          ...        ...     ...         ...         ...      ...
994   Product_1   Region_4   95.24         7.0  2024-09-21   666.68
995         NaN   Region_7   31.83        13.0  2024-09-22   413.79
997         NaN   Region_7  311.80        13.0  2024-09-24  4053.40
998   Product_2  Region_10   43.44        15.0  2024-09-25   651.60
999  Product_35   Region_8   56.95         6.0  2024-09-26   341.70

[900 rows x 6 columns]

In [9]:
#drop rows with revenue = NaN because either the price or units sold is zero, which is impossible to calculate
data = data.dropna(subset='Revenue')
data

        Product     Region   Price  Units Sold   Sale Date  Revenue
0           NaN   Region_6   75.96        10.0  2022-01-01   759.60
1           NaN   Region_1  175.78         8.0  2022-01-02  1406.24
2    Product_46   Region_3   20.43        12.0  2022-01-03   245.16
3    Product_36   Region_1   12.77        10.0  2022-01-04   127.70
4    Product_17   Region_6  125.69         6.0  2022-01-05   754.14
..          ...        ...     ...         ...         ...      ...
994   Product_1   Region_4   95.24         7.0  2024-09-21   666.68
995         NaN   Region_7   31.83        13.0  2024-09-22   413.79
997         NaN   Region_7  311.80        13.0  2024-09-24  4053.40
998   Product_2  Region_10   43.44        15.0  2024-09-25   651.60
999  Product_35   Region_8   56.95         6.0  2024-09-26   341.70

[724 rows x 6 columns]